tutorials/solution-time/SIPM-SP/threeCavity/momPred/caseB/system/cavityL/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          0;
        maxIter          1000;
        tolerance        1e-7;
        relTol           0.00;
    }
    p_rghFinal
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          0;
        maxIter          2000;
        tolerance        1e-7;
        relTol           0;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter          1;
        maxIter          2000;
        tolerance        1e-7;
        relTol           0;
    }
    T
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter          0;
        maxIter          2000;
        tolerance        1e-7;
        relTol           0;
    }
    G
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          1;
        maxIter          1000;
        tolerance        1e-7;
        relTol           0;
    }
    epsilon
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter          1;
        maxIter          100;
        tolerance        1e-7;
        relTol           0;
    }
    k
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter          1;
        maxIter          100;
        tolerance        1e-7;
        relTol           0;
    }
}

PISO
{
    momentumPredictor 	yes;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    p_rghRefCell        0;
    p_rghRefValue       0;
}

relaxationFactors
{
	//U	1;
}


// ************************************************************************* //
